{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\mixrandregret\certification\empirical test\Certification lines.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 May 2022, 16:53:05

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. *! 1.1.0 17 Jan 2022
. * Author: Ziyue ZHU (ziyue.zhu@student.kuleuven.be) 
. 
. /*==================================*/
. /*====      Setting up        ======*/
. /*==================================*/
. clear all
{res}{txt}
{com}. /*You need to adjust this and change it for the folder where you will be developing the command.*/
. global route = "D:\mixrandregret\src"
{txt}
{com}. cd "$route"
{res}D:\mixrandregret\src
{txt}
{com}. /*This will search for the adofile of the command.*/
. findfile mixrandregret.ado
{txt}./mixrandregret.ado

{com}. 
. 
. set seed 777
{txt}
{com}. local J  4   /*Number of alternatives*/
{txt}
{com}. local N  10 /*Number of Individuals*/
{txt}
{com}. local t  3 /*Number of choice sets per individual*/
{txt}
{com}. 
. /*===================================================*/
. /*===  Define the inputs for mata evaluator    ======*/
. /*===================================================*/
. 
. /*Star defining the inputs for the mata evaluator defined latter.*/
. local rhs "x1 x2"   // right hand side variables: defined by hand
{txt}
{com}. local lhs "choice"  // left hand side variables: defined by hand
{txt}
{com}. local group "id_cs" // variable with choice sets
{txt}
{com}. local id "id_ind"   // individual ID
{txt}
{com}. 
. local nrep 50       // # of halton draws per random variable
{txt}
{com}. local kfix 1         // # of fixed variable (0 in this script)
{txt}
{com}. local krnd 2        // # of random variables (both 2 variables, x1 x2)
{txt}
{com}. local burn 15       // # of burning draws in halton 
{txt}
{com}. 
. /*Set total number of observations on the data*/
. set obs  `=`N'*`t'*`J''
{txt}{p}
number of observations (_N)  was 0,
now 120
{p_end}

{com}. * 20 individuals choose from 25 choice sets, and each choice set includes 3 alternatives
. *ssc install seq 
. 
. /* id_ind = id for each individual */
. seq id_ind, b(`=`J'*`t'')
{txt}
{com}. 
. /* id_cs_of_ind_n = id for each choice situation for each individual n */
. seq id_cs_of_ind_n,  f(1) t(`=`J'') b(`=`J'')
{txt}
{com}. 
. /* id_cs = id choice situations without considering the individual */
. seq id_cs,  f(1) t(`=`J'*`N'*`t'') b(`=`J'')
{txt}
{com}. sort id_cs
{txt}
{com}. 
. /* alternative = size of the choice set from where the individual choose*/
. seq alternative, t(`J')
{txt}
{com}. 
. local s = 5
{txt}
{com}. /*two generic attributes (random)*/
. gen x1 =  runiform(-`s',`s')
{txt}
{com}. gen x2 =  runiform(-`s',`s')
{txt}
{com}. 
. /*create a fix attribute */
. gen x_fix = rnormal(0,1)
{txt}
{com}. 
. /* parameters for distribution */
. local mu_1  = 1
{txt}
{com}. local mu_2  = 2
{txt}
{com}. 
. local sigma_1  = 0.5
{txt}
{com}. local sigma_2  = 0.5
{txt}
{com}. 
. mata: b1 = `mu_1' :+ sort(J(`=`J'*`t'', 1, rnormal(`N',1,0,1)),1) :* `sigma_1'
{res}{txt}
{com}. mata: b2 = `mu_2' :+ sort(J(`=`J'*`t'', 1, rnormal(`N',1,0,1)),1) :* `sigma_2'
{res}{txt}
{com}. 
. //mata: exp_b1 = exp(b1)
. //mata: exp_b1 = exp(b2)
. 
. 
. mata: b = b1 , b2
{res}{txt}
{com}. 
. 
. global individuals = "id_ind"
{txt}
{com}. global choice_sets = "id_cs"
{txt}
{com}. sort id_cs
{txt}
{com}. 
. 
. /*===================================================*/
. /*====             DATA Generation             ======*/
. /* Two (independent) normally distributed parameters */
. /*===================================================*/
. 
. mata:
{txt}{hline 49} mata (type {cmd:end} to exit) {hline}
{com}: /* program a function to calculate observed regret */
: function RRM_log_sim_data(real matrix x_n, 
>                           real rowvector betas)
> {c -(}
>     real scalar i, j
>     real matrix regret_n 
>   
>     regret_n = J(rows(x_n), cols(x_n), 0)
>     for(i=1; i <= rows(x_n); ++i) {c -(} 
>             for(j=1; j <= rows(x_n); ++j) {c -(} 
>                     if (i!=j) {c -(} 
>                             r_i = ln(1 :+ exp( betas :* ( x_n[j , . ] :-  x_n[i, . ])))
>                             regret_n[i, . ] = regret_n[i, . ] :+ r_i
>                     {c )-} 
>             {c )-}  
>     {c )-}
> return(regret_n)
> {c )-}

:                 
: // Generates a view of all attributes (M) x*
: st_view(X = ., ., "x1 x2")
{res}
{com}: 
: // Generates a view id choice situations
: st_view(panvar_choice_sets = ., ., "id_cs")
{res}
{com}: 
: // set up panel information where each panel unit refers to a choice set 
: task_n = panelsetup(panvar_choice_sets, 1)
{res}
{com}: 
: // # of choice sets 
: npanels_choice_sets = panelstats(task_n)[1]
{res}
{com}: 
: for(t=1; t<=npanels_choice_sets; t++) {c -(}
> 
> 
>         // read in data rows pertaining to subject n & store in a matrix suffixed _n
>         x_n = panelsubmatrix(X, t, task_n) 
>         b_n = panelsubmatrix(b, t, task_n) 
>         
>         
>         /*Observed (deterministic) Regret*/
>         R_i = rowsum(RRM_log_sim_data(x_n, b_n[1,])) /*take first row of block of parameters*/
> 
>         /* Type 1 error */
>         epsilon = -1*log(-log(runiform(rows(R_i),1,0,1)))
>         /*Random regret */
>         RR_i = R_i  :+ epsilon
> 
>         EXP_RR_i = exp(-RR_i)
> 
>         P_i = EXP_RR_i :/ quadcolsum(EXP_RR_i, 1)
> 
>         choice_i = (P_i  :==max(P_i))
>         // collect all choices of choice situations (t) of individual (n)
>         if (t==1)  choice = choice_i
>         else       choice = choice   \ choice_i
> 
> {c )-}
{res}
{com}: // Creates a new Stata variable called "choice"    
:  idx = st_addvar("float", "choice")
{res}
{com}: // save the content of Y on "choice" Stata variable
:  st_store(., idx, choice)
{res}
{com}: 
: end
{txt}{hline}

{com}. 
. /*==================================*/
. /*====     Testing lines      ======*/
. /*==================================*/
. 
. mixrandregret choice x_fix, nrep(5) iter(1) group(id_cs) id(id_ind) rand(x1 x2) alt(alternative) base(2)
{txt}./mixRRM_gf0.mata
{res}
{txt}initial:{col 16}log likelihood = {res:-41.588831}
alternative:{col 16}log likelihood = {res:-43.158862}
rescale:{col 16}log likelihood = {res:-41.150214}
rescale eq:{col 16}log likelihood = {res:-39.498411}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-39.498411}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-27.320639}  (not concave)
convergence not achieved
{res}
{txt}Case ID variable: id_cs{col 48}Number of cases{col 67}= {res}        30
{txt}Alternative variable: alternative{col 48}
Random variable(s): x1 x2{col 48}


Mixed random regret model{col 49}Number of obs{col 67}= {res}       120
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(2)}{col 67}=          {res}.
{txt}Log likelihood = {res}-27.320639{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Mean         {txt}{c |}
{space 7}x_fix {c |}{col 14}{res}{space 2} .0309825{col 26}{space 2} .1600071{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-.2826258{col 67}{space 3} .3445907
{txt}{space 10}x1 {c |}{col 14}{res}{space 2}-.0217365{col 26}{space 2} .0829349{col 37}{space 1}   -0.26{col 46}{space 3}0.793{col 54}{space 4} -.184286{col 67}{space 3} .1408129
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} .1275576{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}SD           {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .1297097{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.3585645{col 26}{space 2} .3248955{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4} -.995348{col 67}{space 3}  .278219
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ASC          {txt}{c |}
{space 7}ASC_1 {c |}{col 14}{res}{space 2}-.0421649{col 26}{space 2} .2675588{col 37}{space 1}   -0.16{col 46}{space 3}0.875{col 54}{space 4}-.5665705{col 67}{space 3} .4822407
{txt}{space 7}ASC_3 {c |}{col 14}{res}{space 2}-.1657887{col 26}{space 2} .3168767{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-.7868556{col 67}{space 3} .4552781
{txt}{space 7}ASC_4 {c |}{col 14}{res}{space 2}-.1623856{col 26}{space 2} .2324925{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4}-.6180625{col 67}{space 3} .2932914
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Warning: convergence not achieved

The sign of the estimated standard deviations is irrelevant: interpret them as
being positive

Note: we don't estimate random regret model to get inital values in mixed version.{col 48}
Users are advised to estimate on their own to make comparsion{col 48}

{com}. 
. mixrpred p, xb
{res}{txt}
{com}. mixrpred regret
(option proba assumed; probability of success given one success within group)
{res}{txt}
{com}. 
. mixrbeta x1 x2 x_fix, plot nrep(10) saving(new_betas) replace
{res}{txt}file new_betas.dta saved
{res}{txt}(file x1.gph saved)
{res}{txt}(file x2.gph saved)
{res}{txt}(file x_fix.gph saved)

{com}. 
. 
. /*==================================*/
. /*====  Certification lines   ======*/
. /*==================================*/
. 
. * cluster check
. mixrandregret choice x_fix, cluster(id_cs) group(id_cs) id(id_ind) rand(x1 x2) alt(alternative) basealternative(1) iter(1)
{txt}./mixRRM_gf0.mata
{res}
{txt}initial:{col 16}log likelihood = {res:-41.588831}
alternative:{col 16}log likelihood = {res:-41.516581}
rescale:{col 16}log likelihood = {res:-40.542924}
rescale eq:{col 16}log likelihood = {res:-33.744513}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-33.744513}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-31.254279}  (not concave)
convergence not achieved
{res}
{txt}Case ID variable: id_cs{col 48}Number of cases{col 67}= {res}        30
{txt}Alternative variable: alternative{col 48}
Random variable(s): x1 x2{col 48}

{col 34}(Std. Err. adjusted for{res}   30{txt} clusters in id_cs)

Mixed random regret model{col 49}Number of obs{col 67}= {res}       120
{txt}{col 49}{help j_robustsingular##|_new:Wald chi2(1)}{col 67}=          {res}.
{txt}Log likelihood = {res}-31.254279{txt}{col 49}Prob > chi2{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}Mean         {txt}{c |}
{space 7}x_fix {c |}{col 14}{res}{space 2} .2850347{col 26}{space 2} .2130482{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.1325321{col 67}{space 3} .7026016
{txt}{space 10}x1 {c |}{col 14}{res}{space 2} .9024697{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} .0278654{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}SD           {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2}-1.597328{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-.3600129{col 26}{space 2} .1503544{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.6547022{col 67}{space 3}-.0653237
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ASC          {txt}{c |}
{space 7}ASC_2 {c |}{col 14}{res}{space 2}-.4914465{col 26}{space 2} .3553659{col 37}{space 1}   -1.38{col 46}{space 3}0.167{col 54}{space 4}-1.187951{col 67}{space 3} .2050578
{txt}{space 7}ASC_3 {c |}{col 14}{res}{space 2}-.4999144{col 26}{space 2} .3781575{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-1.241089{col 67}{space 3} .2412607
{txt}{space 7}ASC_4 {c |}{col 14}{res}{space 2}-.5085542{col 26}{space 2} .3205147{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-1.136751{col 67}{space 3}  .119643
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Warning: convergence not achieved

The sign of the estimated standard deviations is irrelevant: interpret them as
being positive

Note: we don't estimate random regret model to get inital values in mixed version.{col 48}
Users are advised to estimate on their own to make comparsion{col 48}

{com}. 
. * Option basealternative() not compatible with noconstant
. mixrandregret choice x_fix, nrep(1) group(id_cs) id(id_ind) rand(x1 x2) alt(alternative) basealternative(3) iter(1) noconstant
{txt}./mixRRM_gf0.mata
{err}Option basealternative() not compatible with noconstant.
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * Variable in alternatives() does not contain basealternative(#) provided 
. mixrandregret choice x_fix, nrep(1) group(id_cs) id(id_ind) rand(x1 x2) alt(alternative) basealternative(5) iter(1)
{txt}./mixRRM_gf0.mata
{err}Variable in alternatives() does not contain basealternative(#) provided 
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * In option basealternative(#), # must be numeric.
. mixrandregret choice x_fix, nrep(1) group(id_cs) id(id_ind) rand(x1 x2) alt(alternative) basealternative("a") iter(1)
{txt}./mixRRM_gf0.mata
{err}In option basealternative(#), # must be numeric.
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * The group variable must be numeric
. gen group_string = "a"
{txt}
{com}. rcof "noisily mixrandregret choice x_fix, group(group_string) id(id_ind) rand(x1 x2) alt(alter)" == 498
{txt}./mixRRM_gf0.mata
{err}The group variable must be numeric
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * The alternative variable must be numeric
. gen alter_string = "b"
{txt}
{com}. rcof "noisily mixrandregret choice x_fix, group(id_cs) id(id_ind) rand(x1 x2) alt(alter_string)" == 498
{txt}./mixRRM_gf0.mata
{err}The alternative variable must be numeric
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * The id variable must be numeric
. gen id_string = "c"
{txt}
{com}. rcof "noisily mixrandregret choice x_fix, group(id_cs) id(id_string) rand(x1 x2) alt(alternative)" == 498
{txt}./mixRRM_gf0.mata
{err}The id variable must be numeric
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * The cluster variable must be numeric
. gen cluster_str = "d"
{txt}
{com}. rcof "noisily mixrandregret choice x_fix, group(id_cs) id(id_ind) rand(x1 x2) alt(alternative) cluster(cluster_str)" == 498
{txt}./mixRRM_gf0.mata
{err}The cluster variable must be numeric
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * prevent user from using same variable as random and fix 
. rcof "noisily mixrandregret choice x_fix x2 , group(id_cs) id(id_ind) rand(x1 x2) alt(alternative)" == 498
{txt}./mixRRM_gf0.mata
{err}The variable x2 is specified to have both fixed and random coefficients
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * multicollinearity
. gen x_coll = x_fix
{txt}
{com}. rcof "noisily mixrandregret choice x_fix x_coll, group(id_cs) id(id_ind) rand(x1 x2) alt(alternative)" == 498
{txt}./mixRRM_gf0.mata
{err}Some variables are collinear - check your model specification
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * independent variables vary within groups
. gen x_fix_f = 1 if id_cs > 10
{txt}(40 missing values generated)

{com}. replace x_fix_f = 0 if id_cs <= 10
{txt}(40 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. rcof "noisily mixrandregret choice x_fix_f, group(id_cs) id(id_ind) rand(x1 x2) alt(alternative)" == 459
{txt}./mixRRM_gf0.mata
{err}Variable x_fix_f has no within-group variance
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\ThinkPad\AppData\Local\Temp\STD22c4_000000.tmp"
{txt}
{com}. 
. * dependent variable only takes values 0-1
. gen choice_f = 2
{txt}
{com}. rcof "noisily mixrandregret choice_f x_fix, group(id_cs) id(id_ind) rand(x1 x2) alt(alternative)" == 450
{txt}./mixRRM_gf0.mata
{err}The dependent variable must be a 0-1 variable indicating which alternatives are chosen
{txt}
{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\mixrandregret\certification\empirical test\Certification lines.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}12 May 2022, 16:54:42
{txt}{.-}
{smcl}
{txt}{sf}{ul off}